slides/unconverted/2013-02-15-Project.org
* Final Project :slide:

* Deliverables :slide:
  + Project Proposal
  + Written report
  + Presentation
  + Code
  + Data (URL or sampled)
  + *May 16* midnight

* Groups :slide:
  + 1-2 people

* Proposal :slide:
  + Informal, not graded
  + A plan for your project
  + After the proposal you should just be executing, not brainstorming
  + Discussions before proposal encouraged

* Report :slide:
  + Introduction: problem, insights, solutions
  + Problem: motivation, data set
  + Solution: techniques, failures, examples
  + Details: parameter tuning, software engineering challenges
  + Related work: including resources you used
  + Further work: any remaining ideas you have
** Notes :notes:
   + Length: around 2 pages, but more important to hit these points
   + Introduction: "gosh, if these insights are true, it would be really
     exciting"
   + Problem: include problems with your data set
   + Solution: if you do clustering, give examples of a cluster you found and
     individual data points that it contains
   + Details: what commands did you use for particular libraries. Can someone
     duplicate you work?
   + Formats: PDF, Google Doc

* Research Paper :slide:
  + [[http://research.microsoft.com/en-us/um/people/simonpj/papers/giving-a-talk/writing-a-paper-slides.pdf][How to write a good research paper]]
  + But much shorter!
** Skip sections :notes:
   + No abstract
   + Think paragraphs instead of pages

* Presentation :slide:
  + ~10 minutes
  + Think: 1 slide per paragraph
  + Focus on images, stories, examples
  + Motivate people to read your paper, don't read it to them

* Code :slide:
  + Another GitHub repository
  + If private, add Shreyas and me
  + Include README with info on how to run algorithms
  + Suggestion: include your paper
** Reproducible :notes:
   + Imagine if someone wanted to reproduce your results
   + Also great for portfolio (with Paper)

* Data :slide:
  + If large, just point to URL in paper and README
  + If very large, talk with me about hosting on Amazon Web Services
  + We'll have computing resources available from Amazon

#+STYLE: <link rel="stylesheet" type="text/css" href="production/common.css" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
#+STYLE: <link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>

#+BEGIN_HTML
<script type="text/javascript" src="production/org-html-slideshow.js"></script>
#+END_HTML

# Local Variables:
# org-export-html-style-include-default: nil
# org-export-html-style-include-scripts: nil
# buffer-file-coding-system: utf-8-unix
# End:
