slides/2013-02-15-Project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>2013-02-15-Project</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="2013-02-15-Project"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-07 22:49:10 PDT"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">2013-02-15-Project</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Final Project</a></li>
<li><a href="#sec-2">2 Deliverables</a></li>
<li><a href="#sec-3">3 Groups</a></li>
<li><a href="#sec-4">4 Proposal</a></li>
<li><a href="#sec-5">5 Report</a>
<ul>
<li><a href="#sec-5-1">5.1 Notes</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Research Paper</a>
<ul>
<li><a href="#sec-6-1">6.1 Skip sections</a></li>
</ul>
</li>
<li><a href="#sec-7">7 Presentation</a></li>
<li><a href="#sec-8">8 Code</a>
<ul>
<li><a href="#sec-8-1">8.1 Reproducible</a></li>
</ul>
</li>
<li><a href="#sec-9">9 Data</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Final Project &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Deliverables &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Project Proposal
</li>
<li>Written report
</li>
<li>Presentation
</li>
<li>Code
</li>
<li>Data (URL or sampled)
</li>
<li><b>May 16</b> midnight
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Groups &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>1-2 people
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Proposal &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>Informal, not graded
</li>
<li>A plan for your project
</li>
<li>After the proposal you should just be executing, not brainstorming
</li>
<li>Discussions before proposal encouraged
</li>
</ul>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Report &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">

<ul>
<li>Introduction: problem, insights, solutions
</li>
<li>Problem: motivation, data set
</li>
<li>Solution: techniques, failures, examples
</li>
<li>Details: parameter tuning, software engineering challenges
</li>
<li>Related work: including resources you used
</li>
<li>Further work: any remaining ideas you have
</li>
</ul>


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Notes &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>Length: around 2 pages, but more important to hit these points
</li>
<li>Introduction: "gosh, if these insights are true, it would be really
     exciting"
</li>
<li>Problem: include problems with your data set
</li>
<li>Solution: if you do clustering, give examples of a cluster you found and
     individual data points that it contains
</li>
<li>Details: what commands did you use for particular libraries. Can someone
     duplicate you work?
</li>
<li>Formats: PDF, Google Doc
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Research Paper &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">

<ul>
<li><a href="http://research.microsoft.com/en-us/um/people/simonpj/papers/giving-a-talk/writing-a-paper-slides.pdf">How to write a good research paper</a>
</li>
<li>But much shorter!
</li>
</ul>


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Skip sections &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-6-1">

<ul>
<li>No abstract
</li>
<li>Think paragraphs instead of pages
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Presentation &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>~10 minutes
</li>
<li>Think: 1 slide per paragraph
</li>
<li>Focus on images, stories, examples
</li>
<li>Motivate people to read your paper, don't read it to them
</li>
</ul>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Code &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>Another GitHub repository
</li>
<li>If private, add Shreyas and me
</li>
<li>Include README with info on how to run algorithms
</li>
<li>Suggestion: include your paper
</li>
</ul>


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Reproducible &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-8-1">

<ul>
<li>Imagine if someone wanted to reproduce your results
</li>
<li>Also great for portfolio (with Paper)
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Data &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-9">

<ul>
<li>If large, just point to URL in paper and README
</li>
<li>If very large, talk with me about hosting on Amazon Web Services
</li>
<li>We'll have computing resources available from Amazon
</li>
</ul>





<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-05-07 22:49:10 PDT</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
